app/controllers/categories_controller.rb

SELECT COUNT(*) FROM `categories` INNER JOIN `product_categories` ON `product_categories`.`category_id` = `categories`.`id` INNER JOIN `products` ON `products`.`id` = `product_categories`.`product_id`
SELECT COUNT(*) FROM `products` INNER JOIN `product_categories` ON `products`.`id` = `product_categories`.`product_id` WHERE `product_categories`.`category_id` = 21
SELECT categories.*, count(products.id) as products_count FROM `categories` INNER JOIN `product_categories` ON `product_categories`.`category_id` = `categories`.`id` INNER JOIN `products` ON `products`.`id` = `product_categories`.`product_id` GROUP BY categories.id ORDER BY `categories`.`title` ASC
---
  def index
    @message = 'Hello'
    @categories = Category.joins(:products).select('categories.*, count(products.id) as products_count').group('categories.id').order(:title)