app/models/shopping_cart.rb

INSERT INTO `orders` (`sub_total`, `created_at`, `updated_at`, `token`) VALUES (0.0, '2019-11-18 15:49:42.370569', '2019-11-18 15:49:42.370569', 'f573e6057081f44e')
SELECT `orders`.* FROM `orders` WHERE `orders`.`token` = 'f573e6057081f44e' LIMIT 1
---
  def order
    @order ||= Order.find_or_create_by(token: @token) do |order|

SELECT `products`.* FROM `products` WHERE `products`.`id` = 73 LIMIT 1
UPDATE `order_items` SET `order_items`.`quantity` = 1, `order_items`.`updated_at` = '2019-11-18 15:46:14' WHERE `order_items`.`id` = 9
---
  def add_item(product_id:, quantity: 1)
    product = Product.find(product_id)

    order_item = order.items.find_or_initialize_by(
      product_id: product_id
    )

    order_item.price = product.price
    order_item.quantity = quantity

    ActiveRecord::Base.transaction do
      order_item.save

DELETE FROM `order_items` WHERE `order_items`.`id` = 4
---
  def remove_item(id:)
    ActiveRecord::Base.transaction do
      order.items.destroy(id)

UPDATE `orders` SET `orders`.`sub_total` = 977.77, `orders`.`updated_at` = '2019-11-18 15:31:03.615921' WHERE `orders`.`id` = 1
---
def update_sub_total!
  order.sub_total = order.items.sum('quantity * price')
  order.save